#!/bin/bash
./serverctrl.sh start -Heap 4g -Perm 100m

################################
#启动
################################
#./serverctrl.sh start 

################################
#关闭
################################
#./serverctrl.sh stop 

################################
#开启 nohup.out
################################
#./serverctrl.sh start -L

################################
#设置JVM的堆大小
################################
#./serverctrl.sh start -Heap 256m

################################
#设置JVM的持久层大小
################################
#./serverctrl.sh start -Perm 64m

################################
#设置JMX端口
################################
#./serverctrl.sh start -JmxPort 9999

################################
#设置其他Java options
################################
#./serverctrl.sh start -Opts -Djava.awt.headless=true

################################
#设置JVM启动参数
################################
#./serverctrl.sh start  args1 args2


